In [1]:
# PANDAS

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {
    'EmpID':[101,102,103,104,105,106,107,108] , 
    'EmpName':['Raman','Shyam','Mohan','Rohan','Ravi','Yogesh','Riya','Siya'],
    'EmpSalary':[23455,76555,26754,68765,64656,35556,78765,47645]
}

In [5]:
df = pd.DataFrame(data)

In [7]:
df

   EmpID EmpName  EmpSalary
0    101   Raman      23455
1    102   Shyam      76555
2    103   Mohan      26754
3    104   Rohan      68765
4    105    Ravi      64656
5    106  Yogesh      35556
6    107    Riya      78765
7    108    Siya      47645

In [8]:
df.head()

   EmpID EmpName  EmpSalary
0    101   Raman      23455
1    102   Shyam      76555
2    103   Mohan      26754
3    104   Rohan      68765
4    105    Ravi      64656

In [9]:
df.tail()

   EmpID EmpName  EmpSalary
3    104   Rohan      68765
4    105    Ravi      64656
5    106  Yogesh      35556
6    107    Riya      78765
7    108    Siya      47645

In [10]:
df.head(2)

   EmpID EmpName  EmpSalary
0    101   Raman      23455
1    102   Shyam      76555

In [11]:
df.tail(2)

   EmpID EmpName  EmpSalary
6    107    Riya      78765
7    108    Siya      47645

In [12]:
df.columns

Index(['EmpID', 'EmpName', 'EmpSalary'], dtype='object')

In [13]:
df['EmpName']

0     Raman
1     Shyam
2     Mohan
3     Rohan
4      Ravi
5    Yogesh
6      Riya
7      Siya
Name: EmpName, dtype: object

In [14]:
df.EmpName

0     Raman
1     Shyam
2     Mohan
3     Rohan
4      Ravi
5    Yogesh
6      Riya
7      Siya
Name: EmpName, dtype: object

In [15]:
df.EmpSalary

0    23455
1    76555
2    26754
3    68765
4    64656
5    35556
6    78765
7    47645
Name: EmpSalary, dtype: int64

In [16]:
df.EmpSalary.sum()

np.int64(422151)

In [17]:
df.EmpSalary.min()

np.int64(23455)

In [18]:
df.EmpSalary.max()

np.int64(78765)

In [19]:
df.EmpSalary.mean()

np.float64(52768.875)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   EmpID      8 non-null      int64
 1   EmpName    8 non-null      object
 2   EmpSalary  8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 324.0+ bytes

In [21]:
df.describe()

           EmpID     EmpSalary
count    8.00000      8.000000
mean   104.50000  52768.875000
std      2.44949  22352.283881
min    101.00000  23455.000000
25%    102.75000  33355.500000
50%    104.50000  56150.500000
75%    106.25000  70712.500000
max    108.00000  78765.000000